project1.postman_collection.json

{
	"info": {
		"_postman_id": "65d67db7-4e5f-4d4f-8663-68d313b12fa7",
		"name": "project1",
		"schema": "https://schema.getpostman.com/json/collection/v2.0.0/collection.json",
		"_exporter_id": "29122813"
	},
	"item": [
		{
			"name": "numberstowords",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <soap:Body>\r\n        <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n          <ubiNum>23000003457</ubiNum>\r\n        </NumberToWords> \r\n    </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "https://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		}
	]
}